app/controllers/merchants_controller.rb

SELECT "merchants".* FROM "merchants"
---
  def index
    @merchants = Merchant.all