app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.all

INSERT INTO "merchants" ("merchant_name", "merchant_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["merchant_name", "Carpenter Outfitters"], ["merchant_address", "99 Factory Drive"], ["created_at", "2020-10-13 03:59:13.082277"], ["updated_at", "2020-10-13 03:59:13.082277"]]
INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jack Burton"], ["created_at", "2020-10-13 03:59:13.119169"], ["updated_at", "2020-10-13 03:59:13.119169"]]
INSERT INTO "products" ("description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Premium Cowboy Boots"], ["price", "149.99"], ["created_at", "2020-10-13 03:59:13.157828"], ["updated_at", "2020-10-13 03:59:13.157828"]]
INSERT INTO "sales" ("merchant_id","customer_id","product_id","quantity","created_at","updated_at") VALUES (1, 1, 1, 1.0, '2020-10-13 03:59:13.173001', '2020-10-13 03:59:13.173009'), (2, 2, 2, 2.0, '2020-10-13 03:59:13.210842', '2020-10-13 03:59:13.210850'), (3, 3, 3, 4.0, '2020-10-13 03:59:13.239730', '2020-10-13 03:59:13.239737'), (2, 4, 2, 3.0, '2020-10-13 03:59:13.283090', '2020-10-13 03:59:13.283099'), (5, 2, 5, 1.0, '2020-10-13 03:59:13.314428', '2020-10-13 03:59:13.314441') RETURNING "id"
---
  def upload_sales
    if params[:csv]
      file = params[:csv].tempfile

      new_sales = []
      CSV.foreach(file, headers: true, header_converters: :symbol, converters: :all) do |row|
        # create or update merchant
        m = Merchant.create_or_find_by(merchant_name: row[:merchant_name]) do |merchant|
          merchant.merchant_address = row[:merchant_address]
        end
        # create or update customer
        c = Customer.create_or_find_by(name: row[:customer_name])
        # create or update product
        p = Product.create_or_find_by(description: row[:item_description], price: row[:item_price])
        # create sale
        # s = Sale.new(merchant_id: m.id, customer_id: c.id, product_id: p.id, quantity: :quantity)
        s = {merchant_id: m.id, customer_id: c.id, product_id: p.id, quantity: row[:quantity], created_at: Time.now, updated_at: Time.now}
        new_sales.append(s)
      end

      respond_to do |format|
        if Sale.insert_all!(new_sales)

DELETE FROM "sales" WHERE "sales"."id" = $1  [["id", 1]]
---
  def destroy
    @sale.destroy

SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sale
      @sale = Sale.find(params[:id])